doc.org
#+TITLE: Halpha emitters in IGAPS
:PROPERTIES:
:ID:       20231005_halpha_emitters
:END:

* Classifying Halpha emitters in IGAPS
** Objetivo
Identificar Nebulosas Planetarias (PNe), Estrellas Simbióticas (SySt) y otros emisores de Hα interesantes
en el catálogo de [[https://ui.adsabs.harvard.edu/abs/2020A%26A...638A..18M/abstract][Monguió et al. 2020]] para seguimiento espectroscópico.

*** Estrategia General
- Uso de técnicas no supervisadas (UMAP + HDBSCAN) en datos fotométricos.
- Combinación con datos multi-longitud de onda (allWISE, 2MASS).
- Validación cruzada con catálogos conocidos (SIMBAD, HASH).

** Crossmatching con allWISE usando TOPCAT
:PROPERTIES:
:header-args: :eval never
:END:

*** Radio de Búsqueda Óptimo
- Recomendación inicial: 2 arcsec (equilibrio entre completitud y precisión en el plano Galáctico).
- Justificación:
  - Precisión astrométrica de IGAPS (Gaia DR2): ~0.1 arcsec.
  - Precisión de allWISE: ~1-3 arcsec (dependiendo del brillo).
  - Alta densidad de fuentes en el disco → riesgo de falsos matches con radio <1.5 arcsec.

*** Pasos en TOPCAT
1. Cargar catálogos:
   - IGAPS (8,292 emisores + 53,000 variables).
   - allWISE (usar versión "allwise" para cobertura completa).

2. Realizar crossmatch:
   #+BEGIN_SRC text
   Joins → Pair Matching
   - Sky Error: 3 arcsec (radio conservador)
   - Activar "Best Match" (1-to-1 matching)
   #+END_SRC

3. Filtrar resultados:
   - Conservar matches con separación angular <2 arcsec:
     #+BEGIN_SRC java
     (Distance < 2.0) 
     #+END_SRC
   - Filtrar por calidad fotométrica en WISE:
     #+BEGIN_SRC java
     && (WISE_ph_qual.equals("AAAA"))  // Solo detecciones confiables en todas las bandas
     #+END_SRC

*** Validación
- Generar histograma de separaciones angulares:
  - Los verdaderos matches se concentran cerca de 0 arcsec.
  - Ejemplo de corte: 90% de los matches reales están <1.5 arcsec.

- Coherencia fotométrica:
  - Fuentes rojas en IGAPS (g−r >1.5) deben mostrar exceso IR (W1−W2 >0.5).

** Análisis con UMAP + HDBSCAN
*** Features Clave
| Feature          | Descripción                             | Relevancia para SySt/PNe          |
|------------------+-----------------------------------------+------------------------------------|
| r − Hα           | Exceso de emisión en Hα                 | >0.8 mag para PNe/SySt             |
| abs(rI − rU)      | Variabilidad                            | SySt: >0.3 mag, PNe: <0.2 mag      |
| W1 − W2          | Exceso infrarrojo                       | SySt: >0.5 mag (gigante fría)      |
| J − K (2MASS)    | Exceso IR adicional                     | SySt: >1.0 mag                     |

+ Importante aqui usar el criterio de variabilidad.

*** Código de Ejemplo (Python)
#+BEGIN_SRC python
import umap, hdbscan
from sklearn.preprocessing import StandardScaler

features = df[['r_Halpha', 'r_diff', 'W1_W2', 'J_K']]
scaler = StandardScaler()
scaled_data = scaler.fit_transform(features)

# Reducción UMAP
reducer = umap.UMAP(n_neighbors=20, min_dist=0.1, n_components=2)
embedding = reducer.fit_transform(scaled_data)

# Clustering HDBSCAN
clusterer = hdbscan.HDBSCAN(min_cluster_size=25, min_samples=8)
clusters = clusterer.fit_predict(embedding)
#+END_SRC

** Resultados Esperados
- Clústeres con alta probabilidad de SySt/PNe:
  - Alto exceso Hα (r−Hα >1.0).
  - Variabilidad moderada (0.3 < |rI−rU| <1.0).
  - Exceso IR (W1−W2 >0.5, J−K >1.0).

