doc.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-04-20 Sun 22:08 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Halpha emitters in IGAPS</title>
<meta name="author" content="Luis" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Halpha emitters in IGAPS</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org1ec7296">1. Classifying Halpha emitters in IGAPS</a>
<ul>
<li><a href="#org68023a0">1.1. Objetivo</a>
<ul>
<li><a href="#org5f4d010">1.1.1. Estrategia General</a></li>
</ul>
</li>
<li><a href="#org51623ee">1.2. Crossmatching con allWISE usando TOPCAT</a>
<ul>
<li><a href="#org447183c">1.2.1. Radio de Búsqueda Óptimo</a></li>
<li><a href="#org00e4b47">1.2.2. Pasos en TOPCAT</a></li>
<li><a href="#org19fed6f">1.2.3. Validación</a></li>
</ul>
</li>
<li><a href="#orgbe81b52">1.3. Análisis con UMAP + HDBSCAN</a>
<ul>
<li><a href="#org15e5a86">1.3.1. Features Clave</a></li>
<li><a href="#orga0f0a2e">1.3.2. Código de Ejemplo (Python)</a></li>
</ul>
</li>
<li><a href="#orga5acdf7">1.4. Resultados Esperados</a></li>
<li><a href="#orgc8a1bf0">1.5. Preliminary results</a></li>
<li><a href="#org13ea2e9">1.6. I need to do..</a>
<ul>
<li><a href="#orgde4e2d7">1.6.1. Estrategia para GRUPO 4 (Alta Pureza de PNe)</a></li>
<li><a href="#orgbf8f308">1.6.2. Estrategia para NOISE (PNe Atípicas)</a></li>
<li><a href="#org228563c">1.6.3. Herramientas de Soporte</a></li>
<li><a href="#org75c96a2">1.6.4. Consideraciones Clave</a></li>
<li><a href="#org30334f9">1.6.5. Timeline Estimado</a></li>
</ul>
</li>
<li><a href="#orged72986">1.7. Defensa del Método: Contaminación en Grupo 4</a>
<ul>
<li><a href="#orga98dab5">1.7.1. Resumen Estratégico para Revisores</a></li>
<li><a href="#org5323640">1.7.2. Explicación Física: ¿Por qué Grupo 4 contiene PNe y YSOs?</a></li>
</ul>
</li>
<li><a href="#org7b9c047">1.8. Referencias</a></li>
<li><a href="#org63e7c9e">1.9. Análisis Paralelo: Estrellas Be en los Clusters</a>
<ul>
<li><a href="#org15f9e77">1.9.1. Grupos Relevantes para Estrellas Be</a></li>
<li><a href="#org5be2960">1.9.2. Criterios para Filtrar Candidatos Be</a></li>
<li><a href="#org2e49bb0">1.9.3. Colaboración con Especialista en Estrellas Be</a></li>
<li><a href="#org01fd11c">1.9.4. Tabla de Ejemplo de Candidatos Be (Top 5)</a></li>
<li><a href="#org292f519">1.9.5. Beneficios para el Proyecto Principal (PNe)</a></li>
</ul>
</li>
<li><a href="#orgd45095b">1.10. Nota: Proyecto Futuro Independiente</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
:ID:       20231005<sub>halpha</sub><sub>emitters</sub>
</p>

<div id="outline-container-org1ec7296" class="outline-2">
<h2 id="org1ec7296"><span class="section-number-2">1.</span> Classifying Halpha emitters in IGAPS</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org68023a0" class="outline-3">
<h3 id="org68023a0"><span class="section-number-3">1.1.</span> Objetivo</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Identificar Nebulosas Planetarias (PNe), Estrellas Simbióticas (SySt) y otros emisores de Hα interesantes en el catálogo de <a href="https://ui.adsabs.harvard.edu/abs/2020A%26A...638A..18M/abstract">Monguió et al. 2020</a> para seguimiento espectroscópico.
</p>
</div>

<div id="outline-container-org5f4d010" class="outline-4">
<h4 id="org5f4d010"><span class="section-number-4">1.1.1.</span> Estrategia General</h4>
<div class="outline-text-4" id="text-1-1-1">
<ul class="org-ul">
<li>Uso de técnicas no supervisadas (UMAP + HDBSCAN) en datos fotométricos.</li>
<li>Combinación con datos multi-longitud de onda (allWISE, 2MASS).</li>
<li>Validación cruzada con catálogos conocidos (SIMBAD, HASH).</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org51623ee" class="outline-3">
<h3 id="org51623ee"><span class="section-number-3">1.2.</span> Crossmatching con allWISE usando TOPCAT</h3>
<div class="outline-text-3" id="text-1-2">
</div>

<div id="outline-container-org447183c" class="outline-4">
<h4 id="org447183c"><span class="section-number-4">1.2.1.</span> Radio de Búsqueda Óptimo</h4>
<div class="outline-text-4" id="text-1-2-1">
<ul class="org-ul">
<li>Recomendación inicial: 2 arcsec (equilibrio entre completitud y precisión en el plano Galáctico).</li>
<li>Justificación:
<ul class="org-ul">
<li>Precisión astrométrica de IGAPS (Gaia DR2): ~0.1 arcsec.</li>
<li>Precisión de allWISE: ~1-3 arcsec (dependiendo del brillo).</li>
<li>Alta densidad de fuentes en el disco → riesgo de falsos matches con radio &lt;1.5 arcsec.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org00e4b47" class="outline-4">
<h4 id="org00e4b47"><span class="section-number-4">1.2.2.</span> Pasos en TOPCAT</h4>
<div class="outline-text-4" id="text-1-2-2">
<ol class="org-ol">
<li>Cargar catálogos:
<ul class="org-ul">
<li>IGAPS (8,292 emisores + 53,000 variables).</li>
<li>allWISE (usar versión "allwise" para cobertura completa).</li>
</ul></li>

<li><p>
Realizar crossmatch:
</p>
<div class="org-src-container">
<pre class="src src-text">Joins &#8594; Pair Matching
- Sky Error: 3 arcsec (radio conservador)
- Activar "Best Match" (1-to-1 matching)
</pre>
</div></li>

<li>Filtrar resultados:
<ul class="org-ul">
<li><p>
Conservar matches con separación angular &lt;2 arcsec:
</p>
<div class="org-src-container">
<pre class="src src-java">(Distance &lt; 2.0) 
</pre>
</div></li>
<li><p>
Filtrar por calidad fotométrica en WISE:
</p>
<div class="org-src-container">
<pre class="src src-java">&amp;&amp; (WISE_ph_qual.equals(<span style="color: #ffa07a;">"AAAA"</span>))  <span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">Solo detecciones confiables en todas las bandas</span>
</pre>
</div></li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-org19fed6f" class="outline-4">
<h4 id="org19fed6f"><span class="section-number-4">1.2.3.</span> Validación</h4>
<div class="outline-text-4" id="text-1-2-3">
<ul class="org-ul">
<li>Generar histograma de separaciones angulares:
<ul class="org-ul">
<li>Los verdaderos matches se concentran cerca de 0 arcsec.</li>
<li>Ejemplo de corte: 90% de los matches reales están &lt;1.5 arcsec.</li>
</ul></li>

<li>Coherencia fotométrica:
<ul class="org-ul">
<li>Fuentes rojas en IGAPS (g−r &gt;1.5) deben mostrar exceso IR (W1−W2 &gt;0.5).</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgbe81b52" class="outline-3">
<h3 id="orgbe81b52"><span class="section-number-3">1.3.</span> Análisis con UMAP + HDBSCAN</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-org15e5a86" class="outline-4">
<h4 id="org15e5a86"><span class="section-number-4">1.3.1.</span> Features Clave</h4>
<div class="outline-text-4" id="text-1-3-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Feature</th>
<th scope="col" class="org-left">Descripción</th>
<th scope="col" class="org-left">Relevancia para SySt/PNe</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">r − Hα</td>
<td class="org-left">Exceso de emisión en Hα</td>
<td class="org-left">&gt;0.8 mag para PNe/SySt</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">rI − rU</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Variabilidad</td>
<td class="org-left">SySt: &gt;0.3 mag, PNe: &lt;0.2 mag</td>
</tr>

<tr>
<td class="org-left">W1 − W2</td>
<td class="org-left">Exceso infrarrojo</td>
<td class="org-left">SySt: &gt;0.5 mag (gigante fría)</td>
</tr>

<tr>
<td class="org-left">J − K (2MASS)</td>
<td class="org-left">Exceso IR adicional</td>
<td class="org-left">SySt: &gt;1.0 mag</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>Importante aqui usar el criterio de variabilidad.</li>
</ul>
</div>
</div>

<div id="outline-container-orga0f0a2e" class="outline-4">
<h4 id="orga0f0a2e"><span class="section-number-4">1.3.2.</span> Código de Ejemplo (Python)</h4>
<div class="outline-text-4" id="text-1-3-2">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #00ffff;">import</span> umap, hdbscan
<span style="color: #00ffff;">from</span> sklearn.preprocessing <span style="color: #00ffff;">import</span> StandardScaler

<span style="color: #eedd82;">features</span> = df[[<span style="color: #ffa07a;">'r_Halpha'</span>, <span style="color: #ffa07a;">'r_diff'</span>, <span style="color: #ffa07a;">'W1_W2'</span>, <span style="color: #ffa07a;">'J_K'</span>]]
<span style="color: #eedd82;">scaler</span> = StandardScaler()
<span style="color: #eedd82;">scaled_data</span> = scaler.fit_transform(features)

<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">Reducci&#243;n UMAP</span>
<span style="color: #eedd82;">reducer</span> = umap.UMAP(n_neighbors=20, min_dist=0.1, n_components=2)
embedding = reducer.fit_transform(scaled_data)

<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">Clustering HDBSCAN</span>
clusterer = hdbscan.HDBSCAN(min_cluster_size=25, min_samples=8)
clusters = clusterer.fit_predict(embedding)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orga5acdf7" class="outline-3">
<h3 id="orga5acdf7"><span class="section-number-3">1.4.</span> Resultados Esperados</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>Clústeres con alta probabilidad de SySt/PNe:
<ul class="org-ul">
<li>Alto exceso Hα (r−Hα &gt;1.0).</li>
<li>Variabilidad moderada (0.3 &lt; |rI−rU| &lt;1.0).</li>
<li>Exceso IR (W1−W2 &gt;0.5, J−K &gt;1.0).</li>
</ul></li>
</ul>
</div>
</div>
