doc.org
** Preliminary results

Grupo 4 de la version 4 del script que escribí para encontrar los grupos usando IGAPS+Wise+2mass,
es el gupo que tiene más PNe, es bastante prometedor.
Tiene 15 confirmed PNe nad 9 PN candidates, aunque tine bastante contaminación por YSOs.

Una detallada, explicación de estos primeros resultados:

1. Cluster 0 (1023 objetos):

    Composición Principal:

        567 EmLine* (estrellas con líneas de emisión, incluyendo posibles SySts).

        156 Be* (estrellas Be, emisión Hα pero no SySts).

        46 YSO_Candidate (objetos jóvenes, podrían confundirse con SySts en colores IR).

    Acciones:

        Filtrar por W1-W2: Las SySts suelen tener W1-W2 > 0.5, mientras que YSOs y Be stars tienden a valores más bajos.

        Variabilidad (var_r): SySts suelen ser variables (var_r > 0.3), mientras que las estrellas Be tienen variabilidad más suave.

2. Cluster 1 (500 objetos):

    Destacado:

        5 PlanetaryNeb_Candidate y 2 PlanetaryNeb (posibles PNe verdaderos).

        1 Symbiotic* (¡SySt confirmada!).

        61 YSO_Candidate y 79 YSO (contaminantes clave).

    Acciones:

        Priorizar objetos con r-Hα > 1.0 y W1-W2 < 0.3: Las PNe tienen fuerte emisión Hα y poco polvo.

        Excluir fuentes con J-H > 0.8: Las YSOs tienen exceso IR más pronunciado que las PNe.

3. Cluster 4 (202 objetos):

    Clave:

        15 PlanetaryNeb y 9 PlanetaryNeb_Candidate (grupo más prometedor para PNe).

        42 YSO_Candidate y 41 YSO (contaminación a reducir).

    Acciones:

        Filtro Morfológico: Usar Elli (elipticidad en IGAPS) para descartar YSOs/extendidos.

        Corte en g-r: Las PNe tienen estrellas centrales calientes (g-r < 0.5), mientras que YSOs son más rojos.

Estrategias para Mejorar la Pureza de Clusters

+ Características Clave para SySts
| Parámetro | SySts Típicos | Contaminantes Comunes |
|-----------+---------------+-----------------------|
| r-Hα      | 0.8–1.5       | Be stars: 0.2–0.6     |
| W1-W2     | 0.5–1.0       | YSOs: >1.0            |
| var_r     | >0.3          | Be stars: <0.2        |
| J-H       | 0.7–1.0       | YSOs: >1.2            |

+ Características Clave para PNe
| Parámetro | PNe Típicos  | Contaminantes Comunes |
|-----------+--------------+-----------------------|
| r-Hα      | >1.5         | HII regions: 0.8–1.2  |
| W1-W2     | <0.3         | YSOs: >0.5            |
| g-r       | <0.5         | Galaxias: >0.8        |
| Elli      | <0.3         | Galaxias: >0.5        |

+ De los candidatos según SIMBAD al menos 8 son prometedores, es decir excelente targets para follow-spectroscopic.
  
** I need to do..


*** Estrategia para GRUPO 4 (Alta Pureza de PNe)
**** 1. Filtrado Suave
    - Criterios:
      + var_r < 0.2 (excluir variables)
      + J - K < 2.0 (evitar YSOs con polvo frío)
    - Acción:
      #+BEGIN_SRC python
      mask_grupo4 = (df_grupo4["var_r"] < 0.2) & (df_grupo4["J_K"] < 2.0)
      df_grupo4_filtrado = df_grupo4[mask_grupo4]
      #+END_SRC

**** 2. Priorización Espectroscópica
    - Objetivos:
      + Confirmar 9 candidatos (PlanetaryNeb_Candidate)
      + Observar objetos no identificados en SIMBAD
    - Prioridad:
      1. W1 - W2 > 1.0 + r - Hα > 1.5
      2. Recursos limitados: Observar los 5 más brillantes (r < 18)

**** 3. Validación Morfológica
    - Pasos:
      1. Usar imágenes Hα (IPHAS/VPHAS+):
         - Buscar estructura extendida (halos, anillos)
         - Herramienta: [[https://aladin.cds.unistra.fr][Aladin Lite]]
      2. Cruzar con Gaia DR3:
         - Parámetro ipd_gof_harmonic_amplitude > 0.1 (fuentes no puntuales)

**** 4. Análisis de Contaminación
    - Comparar con YSOs en el mismo grupo:
      + Si YSOs persisten, añadir corte en W1 - W2 < 2.0

*** Estrategia para NOISE (PNe Atípicas)
**** 1. Barrido Fotométrico Agresivo
    - Criterios Estrictos:
      #+BEGIN_SRC python
      mask_pne_noise = (
          (df_noise["r_Ha"] > 1.5) &          # Exceso fuerte Hα
          (df_noise["W1_W2"] > 1.0) &         # Polvo cálido
          (df_noise["J_K"] < 1.0) &           # Excluir YSOs
          (df_noise["g_r"] > 0.5) &           # Evitar estrellas azules (CVs)
          (df_noise["var_r"] < 0.1)           # No variables
      )
      candidates_pne_noise = df_noise[mask_pne_noise]
      #+END_SRC

**** 2. Clasificación Manual Exhaustiva
    - Pasos:
      1. Inspección visual en imágenes:
         - Pan-STARRS (óptico), WISE (IR)
         - Buscar morfología extendida o halos
      2. Cruzar con radio (NVSS/SUMSS):
         - Buscar emisión térmica (índice espectral plano)
      3. Revisar Gaia DR3:
         - Fuentes extendidas (ipd_gof_harmonic_amplitude > 0.1)

**** 3. Seguimiento Espectroscópico Selectivo
    - Priorizar candidatos que cumplan:
      + Todos los cortes fotométricos + morfología extendida
    - Ejemplo de targets:
      - Objeto XYZ: r_Ha=1.8, W1-W2=1.2, var_r=0.05

*** Herramientas de Soporte
**** Scripts de Python
    - Preprocesamiento: Limpieza de datos y cortes
    - Visualización: Diagramas de color (Matplotlib/Seaborn)
    #+BEGIN_SRC python
    import matplotlib.pyplot as plt
    plt.scatter(df["r_Ha"], df["W1_W2"], c=df["Class"])
    plt.xlabel("r - Hα"); plt.ylabel("W1 - W2")
    #+END_SRC

