doc.html

<div id="outline-container-orgc8a1bf0" class="outline-3">
<h3 id="orgc8a1bf0"><span class="section-number-3">1.5.</span> Preliminary results</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Grupo 4 de la version 4 del script que escribí para encontrar los grupos usando IGAPS+Wise+2mass,
es el gupo que tiene más PNe, es bastante prometedor.
Tiene 15 confirmed PNe nad 9 PN candidates, aunque tine bastante contaminación por YSOs.
</p>

<p>
Una detallada, explicación de estos primeros resultados:
</p>

<ol class="org-ol">
<li><p>
Cluster 0 (1023 objetos):
</p>

<p>
Composición Principal:
</p>

<p>
567 EmLine* (estrellas con líneas de emisión, incluyendo posibles SySts).
</p>

<p>
156 Be* (estrellas Be, emisión Hα pero no SySts).
</p>

<p>
46 YSO<sub>Candidate</sub> (objetos jóvenes, podrían confundirse con SySts en colores IR).
</p>

<p>
Acciones:
</p>

<p>
Filtrar por W1-W2: Las SySts suelen tener W1-W2 &gt; 0.5, mientras que YSOs y Be stars tienden a valores más bajos.
</p>

<p>
Variabilidad (var<sub>r</sub>): SySts suelen ser variables (var<sub>r</sub> &gt; 0.3), mientras que las estrellas Be tienen variabilidad más suave.
</p></li>

<li><p>
Cluster 1 (500 objetos):
</p>

<p>
Destacado:
</p>

<p>
5 PlanetaryNeb<sub>Candidate</sub> y 2 PlanetaryNeb (posibles PNe verdaderos).
</p>

<p>
1 Symbiotic* (¡SySt confirmada!).
</p>

<p>
61 YSO<sub>Candidate</sub> y 79 YSO (contaminantes clave).
</p>

<p>
Acciones:
</p>

<p>
Priorizar objetos con r-Hα &gt; 1.0 y W1-W2 &lt; 0.3: Las PNe tienen fuerte emisión Hα y poco polvo.
</p>

<p>
Excluir fuentes con J-H &gt; 0.8: Las YSOs tienen exceso IR más pronunciado que las PNe.
</p></li>

<li><p>
Cluster 4 (202 objetos):
</p>

<p>
Clave:
</p>

<p>
15 PlanetaryNeb y 9 PlanetaryNeb<sub>Candidate</sub> (grupo más prometedor para PNe).
</p>

<p>
42 YSO<sub>Candidate</sub> y 41 YSO (contaminación a reducir).
</p>

<p>
Acciones:
</p>

<p>
Filtro Morfológico: Usar Elli (elipticidad en IGAPS) para descartar YSOs/extendidos.
</p>

<p>
Corte en g-r: Las PNe tienen estrellas centrales calientes (g-r &lt; 0.5), mientras que YSOs son más rojos.
</p></li>
</ol>

<p>
Estrategias para Mejorar la Pureza de Clusters
</p>

<ul class="org-ul">
<li>Características Clave para SySts</li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Parámetro</th>
<th scope="col" class="org-left">SySts Típicos</th>
<th scope="col" class="org-left">Contaminantes Comunes</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">r-Hα</td>
<td class="org-left">0.8–1.5</td>
<td class="org-left">Be stars: 0.2–0.6</td>
</tr>

<tr>
<td class="org-left">W1-W2</td>
<td class="org-left">0.5–1.0</td>
<td class="org-left">YSOs: &gt;1.0</td>
</tr>

<tr>
<td class="org-left">var<sub>r</sub></td>
<td class="org-left">&gt;0.3</td>
<td class="org-left">Be stars: &lt;0.2</td>
</tr>

<tr>
<td class="org-left">J-H</td>
<td class="org-left">0.7–1.0</td>
<td class="org-left">YSOs: &gt;1.2</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>Características Clave para PNe</li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Parámetro</th>
<th scope="col" class="org-left">PNe Típicos</th>
<th scope="col" class="org-left">Contaminantes Comunes</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">r-Hα</td>
<td class="org-left">&gt;1.5</td>
<td class="org-left">HII regions: 0.8–1.2</td>
</tr>

<tr>
<td class="org-left">W1-W2</td>
<td class="org-left">&lt;0.3</td>
<td class="org-left">YSOs: &gt;0.5</td>
</tr>

<tr>
<td class="org-left">g-r</td>
<td class="org-left">&lt;0.5</td>
<td class="org-left">Galaxias: &gt;0.8</td>
</tr>

<tr>
<td class="org-left">Elli</td>
<td class="org-left">&lt;0.3</td>
<td class="org-left">Galaxias: &gt;0.5</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>De los candidatos según SIMBAD al menos 8 son prometedores, es decir excelente targets para follow-spectroscopic.</li>
</ul>
</div>
</div>

<div id="outline-container-org13ea2e9" class="outline-3">
<h3 id="org13ea2e9"><span class="section-number-3">1.6.</span> I need to do..</h3>
<div class="outline-text-3" id="text-1-6">
</div>
<div id="outline-container-orgde4e2d7" class="outline-4">
<h4 id="orgde4e2d7"><span class="section-number-4">1.6.1.</span> Estrategia para GRUPO 4 (Alta Pureza de PNe)</h4>
<div class="outline-text-4" id="text-1-6-1">
</div>
<ol class="org-ol">
<li><a id="orge46e35c"></a>1. Filtrado Suave<br />
<div class="outline-text-5" id="text-1-6-1-1">
<ul class="org-ul">
<li>Criterios:
<ul class="org-ul">
<li>var<sub>r</sub> &lt; 0.2 (excluir variables)</li>
<li>J - K &lt; 2.0 (evitar YSOs con polvo frío)</li>
</ul></li>
<li><p>
Acción:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #eedd82;">mask_grupo4</span> = (df_grupo4[<span style="color: #ffa07a;">"var_r"</span>] &lt; 0.2) &amp; (df_grupo4[<span style="color: #ffa07a;">"J_K"</span>] &lt; 2.0)
<span style="color: #eedd82;">df_grupo4_filtrado</span> = df_grupo4[mask_grupo4]
</pre>
</div></li>
</ul>
</div>
</li>

<li><a id="org6f7bc0d"></a>2. Priorización Espectroscópica<br />
<div class="outline-text-5" id="text-1-6-1-2">
<ul class="org-ul">
<li>Objetivos:
<ul class="org-ul">
<li>Confirmar 9 candidatos (PlanetaryNeb<sub>Candidate</sub>)</li>
<li>Observar objetos no identificados en SIMBAD</li>
</ul></li>
<li>Prioridad:
<ol class="org-ol">
<li>W1 - W2 &gt; 1.0 + r - Hα &gt; 1.5</li>
<li>Recursos limitados: Observar los 5 más brillantes (r &lt; 18)</li>
</ol></li>
</ul>
</div>
</li>

<li><a id="org1e10cbf"></a>3. Validación Morfológica<br />
<div class="outline-text-5" id="text-1-6-1-3">
<ul class="org-ul">
<li>Pasos:
<ol class="org-ol">
<li>Usar imágenes Hα (IPHAS/VPHAS+):
<ul class="org-ul">
<li>Buscar estructura extendida (halos, anillos)</li>
<li>Herramienta: <a href="https://aladin.cds.unistra.fr">Aladin Lite</a></li>
</ul></li>
<li>Cruzar con Gaia DR3:
<ul class="org-ul">
<li>Parámetro ipd<sub>gof</sub><sub>harmonic</sub><sub>amplitude</sub> &gt; 0.1 (fuentes no puntuales)</li>
</ul></li>
</ol></li>
</ul>
</div>
</li>

<li><a id="org2a635dc"></a>4. Análisis de Contaminación<br />
<div class="outline-text-5" id="text-1-6-1-4">
<ul class="org-ul">
<li>Comparar con YSOs en el mismo grupo:
<ul class="org-ul">
<li>Si YSOs persisten, añadir corte en W1 - W2 &lt; 2.0</li>
</ul></li>
</ul>
</div>
</li>
</ol>
</div>

<div id="outline-container-orgbf8f308" class="outline-4">
<h4 id="orgbf8f308"><span class="section-number-4">1.6.2.</span> Estrategia para NOISE (PNe Atípicas)</h4>
<div class="outline-text-4" id="text-1-6-2">
</div>
<ol class="org-ol">
<li><a id="org6839923"></a>1. Barrido Fotométrico Agresivo<br />
<div class="outline-text-5" id="text-1-6-2-1">
<ul class="org-ul">
<li><p>
Criterios Estrictos:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #eedd82;">mask_pne_noise</span> = (
    (df_noise[<span style="color: #ffa07a;">"r_Ha"</span>] &gt; 1.5) &amp;          <span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">Exceso fuerte H&#945;</span>
    (df_noise[<span style="color: #ffa07a;">"W1_W2"</span>] &gt; 1.0) &amp;         <span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">Polvo c&#225;lido</span>
    (df_noise[<span style="color: #ffa07a;">"J_K"</span>] &lt; 1.0) &amp;           <span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">Excluir YSOs</span>
    (df_noise[<span style="color: #ffa07a;">"g_r"</span>] &gt; 0.5) &amp;           <span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">Evitar estrellas azules (CVs)</span>
    (df_noise[<span style="color: #ffa07a;">"var_r"</span>] &lt; 0.1)           <span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">No variables</span>
)
<span style="color: #eedd82;">candidates_pne_noise</span> = df_noise[mask_pne_noise]
</pre>
</div></li>
</ul>
</div>
</li>

<li><a id="org77b76ce"></a>2. Clasificación Manual Exhaustiva<br />
<div class="outline-text-5" id="text-1-6-2-2">
<ul class="org-ul">
<li>Pasos:
<ol class="org-ol">
<li>Inspección visual en imágenes:
<ul class="org-ul">
<li>Pan-STARRS (óptico), WISE (IR)</li>
<li>Buscar morfología extendida o halos</li>
</ul></li>
<li>Cruzar con radio (NVSS/SUMSS):
<ul class="org-ul">
<li>Buscar emisión térmica (índice espectral plano)</li>
</ul></li>
<li>Revisar Gaia DR3:
<ul class="org-ul">
<li>Fuentes extendidas (ipd<sub>gof</sub><sub>harmonic</sub><sub>amplitude</sub> &gt; 0.1)</li>
</ul></li>
</ol></li>
</ul>
</div>
</li>

<li><a id="orge2b866b"></a>3. Seguimiento Espectroscópico Selectivo<br />
<div class="outline-text-5" id="text-1-6-2-3">
<ul class="org-ul">
<li>Priorizar candidatos que cumplan:
<ul class="org-ul">
<li>Todos los cortes fotométricos + morfología extendida</li>
</ul></li>
<li>Ejemplo de targets:
<ul class="org-ul">
<li>Objeto XYZ: r<sub>Ha</sub>=1.8, W1-W2=1.2, var<sub>r</sub>=0.05</li>
</ul></li>
</ul>
</div>
</li>
</ol>
</div>

<div id="outline-container-org228563c" class="outline-4">
<h4 id="org228563c"><span class="section-number-4">1.6.3.</span> Herramientas de Soporte</h4>
<div class="outline-text-4" id="text-1-6-3">
</div>
<ol class="org-ol">
<li><a id="org025c0b9"></a>Scripts de Python<br />
<div class="outline-text-5" id="text-1-6-3-1">
<ul class="org-ul">
<li>Preprocesamiento: Limpieza de datos y cortes</li>
<li>Visualización: Diagramas de color (Matplotlib/Seaborn)</li>
</ul>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #00ffff;">import</span> matplotlib.pyplot <span style="color: #00ffff;">as</span> plt
plt.scatter(df[<span style="color: #ffa07a;">"r_Ha"</span>], df[<span style="color: #ffa07a;">"W1_W2"</span>], c=df[<span style="color: #ffa07a;">"Class"</span>])
plt.xlabel(<span style="color: #ffa07a;">"r - H&#945;"</span>); plt.ylabel(<span style="color: #ffa07a;">"W1 - W2"</span>)
</pre>
</div>
</div>
</li>
