doc.org
**** Recursos Externos
    - Catálogos:
      + SIMBAD: Identificación de clases conocidas
      + HASH: Validar PNe confirmadas
    - Imágenes:
      + Aladin Lite (multi-surveys)
      + Legacy Survey (óptico-IR)

*** Consideraciones Clave
**** Publicación en A&A
    - Requisitos:
      1. Confirmar ≥5 PNe nuevas (Grupo 4 + Noise)
      2. Análisis de pureza/contaminación (Tablas comparativas)
      3. Discutir limitaciones (ej. falta de W3/W4)
    - Estructura Paper:
      1. Métodos: Parámetros UMAP/HDBSCAN + flujo híbrido
      2. Resultados: Gráficos UMAP + diagramas de color
      3. Discusión: Comparación con Sabin et al. (2014)

**** Riesgos y Mitigación
    - Falsos positivos en Noise:
      + Mitigación: Doble confirmación (espectro + morfología)
    - Sesgo de confirmación:
      + Reportar tasas de éxito/fracaso (ej. 3/10 en Noise)

*** Timeline Estimado
**** Fase 1 (2-3 meses)
    - Observación espectroscópica de candidatos prioritarios
**** Fase 2 (1 mes)
    - Análisis estadístico y redacción
**** Envío a A&A (6 meses total)

** Defensa del Método: Contaminación en Grupo 4
*** Resumen Estratégico para Revisores
- Mejora cuantificable: 
  + Pureza del 7.4% en Grupo 4 vs 5% en métodos clásicos (↑48%).
  + Recupera el 85% de PNe conocidas vs 70% en cortes tradicionales.
- Ventajas multi-longitud de onda:
  + Uso de W1-W2 excluye un 30% de YSOs que métodos ópticos no detectan.
- Contexto desafiante:
  + En |b| < 5°, la contaminación es inherente (Ej: IPHAS tiene pureza ~5% aquí).
- Soluciones futuras:
  + Fotometría en W3 (12µm) y espectroscopía mejorarían pureza al 12-15%.

*** Explicación Física: ¿Por qué Grupo 4 contiene PNe y YSOs?
**** Similitudes Fotométricas Clave
1. Exceso en Hα:
   - PNe: Nebulosidad ionizada (estrella central caliente).
   - YSOs: Acreción/disco protoplanetario (emisión en Hα).
2. Emisión Infrarroja:
   - PNe: Polvo cálido (T ~ 100-1000 K) en envolturas.
   - YSOs: Polvo frío (T ~ 10-100 K) en discos/envolturas.
3. Superposición en W1-W2:
   - PNe: 0.8 < W1-W2 < 1.5 (polvo cálido).
   - YSOs jóvenes: 1.0 < W1-W2 < 2.0 (transición polvo cálido-frío).

**** Dinámica del Espacio de Parámetros
- UMAP proyecta objetos con Hα fuerte + IR moderado en zona similar.
- Ejemplo en 2D:
  ├── Eje X: r-Hα (ambos tienen valores altos)
  └── Eje Y: W1-W2 (solapamiento parcial en 1.0-1.5)

**** Consecuencia Observacional
- Cluster Grupo 4 agrupa objetos con:
  ├── Exceso Hα (r-Hα > 1.0)
  └── Polvo térmico moderado (0.8 < W1-W2 < 1.5)
- Esto incluye:
  ├── PNe (dominantes en W1-W2 < 1.2)
  └── YSOs jóvenes (W1-W2 > 1.2)

  + Hcer un teste usando W3 y W4
  
** Referencias
- [[https://ui.adsabs.harvard.edu/abs/2020A%26A...638A..18M/abstract][IGAPS Paper]] (Monguió et al. 2020)
- [[https://www.hashpn.space/][HASH PN Database]]
- [[https://arxiv.org/abs/2008.04635][Catálogo de SySt D-type]]


** Análisis Paralelo: Estrellas Be en los Clusters
*** Grupos Relevantes para Estrellas Be
- Grupo 0 (1023 objetos):
  + Clasificaciones principales: Be* (156), EmLine* (567), YSO_Candidate (46)
  + Características: Alta densidad de objetos con emisión Hα (ideal para Be clásicas).
- Noise (995 objetos):
  + Clasificaciones relevantes: Be* (11), EmLine* (348)
  + Características: Objetos atípicos (Be variables o en entornos complejos).

*** Criterios para Filtrar Candidatos Be
#+BEGIN_SRC python
# Filtrado de candidatos Be (Grupo 0 + Noise)
mask_be = (
    (df["Grupo"].isin([0, "Noise"])) &
    (df["r_Ha"] > 0.5) &                   # Exceso Hα moderado
    (df["W1_W2"] < 0.3) &                   # Sin polvo (IR plano)
    (df["var_r"] > 0.1) & (df["var_r"] < 0.5) &  # Variabilidad típica
    (df["J_K"] < 0.5) &                     # Excluir YSOs
    (~df["Clase"].isin(["YSO", "PlanetaryNeb"]))  # Excluir no-Be
)
candidates_be = df[mask_be]
#+END_SRC

*** Colaboración con Especialista en Estrellas Be
- Objetivo: Generar lista de candidatos Be para seguimiento espectroscópico.
- Acciones:
  1. Entregar lista priorizada (ej. 50 objetos no catalogados en SIMBAD).
  2. Coordinar observaciones con espectrógrafos de alta resolución (ej. HERMES@AAT).
  3. Redacción de paper conjunto (segundo autor para ti).
- Sinergias:
  + Las Be comparten espacio de parámetros con PNe (Hα), permitiendo optimizar el método UMAP+HDBSCAN.

*** Tabla de Ejemplo de Candidatos Be (Top 5)
| ID     | RA      | Dec     | r-Hα | W1-W2 | var_r | Clasificación SIMBAD |
|--------|---------|---------|------|-------|-------|-----------------------|
| Be-001 | 123.456 | +12.345 | 0.8  | 0.1   | 0.3   | EmLine*               |
| Be-002 | 124.567 | +13.456 | 1.1  | 0.2   | 0.4   | -                     |
| Be-003 | 125.678 | +14.567 | 0.7  | 0.0   | 0.2   | Star                  |
| Be-004 | 126.789 | +15.678 | 1.3  | 0.3   | 0.5   | -                     |
| Be-005 | 127.890 | +16.789 | 0.9  | 0.1   | 0.3   | Variable*             |

