doc.html

<li><a id="org25225be"></a>Recursos Externos<br />
<div class="outline-text-5" id="text-1-6-3-2">
<ul class="org-ul">
<li>Catálogos:
<ul class="org-ul">
<li>SIMBAD: Identificación de clases conocidas</li>
<li>HASH: Validar PNe confirmadas</li>
</ul></li>
<li>Imágenes:
<ul class="org-ul">
<li>Aladin Lite (multi-surveys)</li>
<li>Legacy Survey (óptico-IR)</li>
</ul></li>
</ul>
</div>
</li>
</ol>
</div>

<div id="outline-container-org75c96a2" class="outline-4">
<h4 id="org75c96a2"><span class="section-number-4">1.6.4.</span> Consideraciones Clave</h4>
<div class="outline-text-4" id="text-1-6-4">
</div>
<ol class="org-ol">
<li><a id="org26dd2b2"></a>Publicación en A&amp;A<br />
<div class="outline-text-5" id="text-1-6-4-1">
<ul class="org-ul">
<li>Requisitos:
<ol class="org-ol">
<li>Confirmar ≥5 PNe nuevas (Grupo 4 + Noise)</li>
<li>Análisis de pureza/contaminación (Tablas comparativas)</li>
<li>Discutir limitaciones (ej. falta de W3/W4)</li>
</ol></li>
<li>Estructura Paper:
<ol class="org-ol">
<li>Métodos: Parámetros UMAP/HDBSCAN + flujo híbrido</li>
<li>Resultados: Gráficos UMAP + diagramas de color</li>
<li>Discusión: Comparación con Sabin et al. (2014)</li>
</ol></li>
</ul>
</div>
</li>

<li><a id="orgadbdf65"></a>Riesgos y Mitigación<br />
<div class="outline-text-5" id="text-1-6-4-2">
<ul class="org-ul">
<li>Falsos positivos en Noise:
<ul class="org-ul">
<li>Mitigación: Doble confirmación (espectro + morfología)</li>
</ul></li>
<li>Sesgo de confirmación:
<ul class="org-ul">
<li>Reportar tasas de éxito/fracaso (ej. 3/10 en Noise)</li>
</ul></li>
</ul>
</div>
</li>
</ol>
</div>

<div id="outline-container-org30334f9" class="outline-4">
<h4 id="org30334f9"><span class="section-number-4">1.6.5.</span> Timeline Estimado</h4>
<div class="outline-text-4" id="text-1-6-5">
</div>
<ol class="org-ol">
<li><a id="org476bcc5"></a>Fase 1 (2-3 meses)<br />
<div class="outline-text-5" id="text-1-6-5-1">
<ul class="org-ul">
<li>Observación espectroscópica de candidatos prioritarios</li>
</ul>
</div>
</li>
<li><a id="orgd2f5118"></a>Fase 2 (1 mes)<br />
<div class="outline-text-5" id="text-1-6-5-2">
<ul class="org-ul">
<li>Análisis estadístico y redacción</li>
</ul>
</div>
</li>
<li><a id="orgf685ee3"></a>Envío a A&amp;A (6 meses total)<br /></li>
</ol>
</div>
</div>

<div id="outline-container-orged72986" class="outline-3">
<h3 id="orged72986"><span class="section-number-3">1.7.</span> Defensa del Método: Contaminación en Grupo 4</h3>
<div class="outline-text-3" id="text-1-7">
</div>
<div id="outline-container-orga98dab5" class="outline-4">
<h4 id="orga98dab5"><span class="section-number-4">1.7.1.</span> Resumen Estratégico para Revisores</h4>
<div class="outline-text-4" id="text-1-7-1">
<ul class="org-ul">
<li>Mejora cuantificable: 
<ul class="org-ul">
<li>Pureza del 7.4% en Grupo 4 vs 5% en métodos clásicos (↑48%).</li>
<li>Recupera el 85% de PNe conocidas vs 70% en cortes tradicionales.</li>
</ul></li>
<li>Ventajas multi-longitud de onda:
<ul class="org-ul">
<li>Uso de W1-W2 excluye un 30% de YSOs que métodos ópticos no detectan.</li>
</ul></li>
<li>Contexto desafiante:
<ul class="org-ul">
<li>En |b| &lt; 5°, la contaminación es inherente (Ej: IPHAS tiene pureza ~5% aquí).</li>
</ul></li>
<li>Soluciones futuras:
<ul class="org-ul">
<li>Fotometría en W3 (12µm) y espectroscopía mejorarían pureza al 12-15%.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org5323640" class="outline-4">
<h4 id="org5323640"><span class="section-number-4">1.7.2.</span> Explicación Física: ¿Por qué Grupo 4 contiene PNe y YSOs?</h4>
<div class="outline-text-4" id="text-1-7-2">
</div>
<ol class="org-ol">
<li><a id="orgaadefeb"></a>Similitudes Fotométricas Clave<br />
<div class="outline-text-5" id="text-1-7-2-1">
<ol class="org-ol">
<li>Exceso en Hα:
<ul class="org-ul">
<li>PNe: Nebulosidad ionizada (estrella central caliente).</li>
<li>YSOs: Acreción/disco protoplanetario (emisión en Hα).</li>
</ul></li>
<li>Emisión Infrarroja:
<ul class="org-ul">
<li>PNe: Polvo cálido (T ~ 100-1000 K) en envolturas.</li>
<li>YSOs: Polvo frío (T ~ 10-100 K) en discos/envolturas.</li>
</ul></li>
<li>Superposición en W1-W2:
<ul class="org-ul">
<li>PNe: 0.8 &lt; W1-W2 &lt; 1.5 (polvo cálido).</li>
<li>YSOs jóvenes: 1.0 &lt; W1-W2 &lt; 2.0 (transición polvo cálido-frío).</li>
</ul></li>
</ol>
</div>
</li>

<li><a id="orge7ed06d"></a>Dinámica del Espacio de Parámetros<br />
<div class="outline-text-5" id="text-1-7-2-2">
<ul class="org-ul">
<li>UMAP proyecta objetos con Hα fuerte + IR moderado en zona similar.</li>
<li>Ejemplo en 2D:
├── Eje X: r-Hα (ambos tienen valores altos)
└── Eje Y: W1-W2 (solapamiento parcial en 1.0-1.5)</li>
</ul>
</div>
</li>

<li><a id="org732591b"></a>Consecuencia Observacional<br />
<div class="outline-text-5" id="text-1-7-2-3">
<ul class="org-ul">
<li>Cluster Grupo 4 agrupa objetos con:
├── Exceso Hα (r-Hα &gt; 1.0)
└── Polvo térmico moderado (0.8 &lt; W1-W2 &lt; 1.5)</li>
<li>Esto incluye:
├── PNe (dominantes en W1-W2 &lt; 1.2)
└── YSOs jóvenes (W1-W2 &gt; 1.2)</li>
</ul>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-org7b9c047" class="outline-3">
<h3 id="org7b9c047"><span class="section-number-3">1.8.</span> Referencias</h3>
<div class="outline-text-3" id="text-1-8">
<ul class="org-ul">
<li><a href="https://ui.adsabs.harvard.edu/abs/2020A%26A...638A..18M/abstract">IGAPS Paper</a> (Monguió et al. 2020)</li>
<li><a href="https://www.hashpn.space/">HASH PN Database</a></li>
<li><a href="https://arxiv.org/abs/2008.04635">Catálogo de SySt D-type</a></li>
</ul>
</div>
</div>


<div id="outline-container-org63e7c9e" class="outline-3">
<h3 id="org63e7c9e"><span class="section-number-3">1.9.</span> Análisis Paralelo: Estrellas Be en los Clusters</h3>
<div class="outline-text-3" id="text-1-9">
</div>
<div id="outline-container-org15f9e77" class="outline-4">
<h4 id="org15f9e77"><span class="section-number-4">1.9.1.</span> Grupos Relevantes para Estrellas Be</h4>
<div class="outline-text-4" id="text-1-9-1">
<ul class="org-ul">
<li>Grupo 0 (1023 objetos):
<ul class="org-ul">
<li>Clasificaciones principales: Be* (156), EmLine* (567), YSO<sub>Candidate</sub> (46)</li>
<li>Características: Alta densidad de objetos con emisión Hα (ideal para Be clásicas).</li>
</ul></li>
<li>Noise (995 objetos):
<ul class="org-ul">
<li>Clasificaciones relevantes: Be* (11), EmLine* (348)</li>
<li>Características: Objetos atípicos (Be variables o en entornos complejos).</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org5be2960" class="outline-4">
<h4 id="org5be2960"><span class="section-number-4">1.9.2.</span> Criterios para Filtrar Candidatos Be</h4>
<div class="outline-text-4" id="text-1-9-2">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">Filtrado de candidatos Be (Grupo 0 + Noise)</span>
<span style="color: #eedd82;">mask_be</span> = (
    (df[<span style="color: #ffa07a;">"Grupo"</span>].isin([0, <span style="color: #ffa07a;">"Noise"</span>])) &amp;
    (df[<span style="color: #ffa07a;">"r_Ha"</span>] &gt; 0.5) &amp;                   <span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">Exceso H&#945; moderado</span>
    (df[<span style="color: #ffa07a;">"W1_W2"</span>] &lt; 0.3) &amp;                   <span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">Sin polvo (IR plano)</span>
    (df[<span style="color: #ffa07a;">"var_r"</span>] &gt; 0.1) &amp; (df[<span style="color: #ffa07a;">"var_r"</span>] &lt; 0.5) &amp;  <span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">Variabilidad t&#237;pica</span>
    (df[<span style="color: #ffa07a;">"J_K"</span>] &lt; 0.5) &amp;                     <span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">Excluir YSOs</span>
    (~df[<span style="color: #ffa07a;">"Clase"</span>].isin([<span style="color: #ffa07a;">"YSO"</span>, <span style="color: #ffa07a;">"PlanetaryNeb"</span>]))  <span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">Excluir no-Be</span>
)
<span style="color: #eedd82;">candidates_be</span> = df[mask_be]
</pre>
</div>
</div>
</div>

<div id="outline-container-org2e49bb0" class="outline-4">
<h4 id="org2e49bb0"><span class="section-number-4">1.9.3.</span> Colaboración con Especialista en Estrellas Be</h4>
<div class="outline-text-4" id="text-1-9-3">
<ul class="org-ul">
<li>Objetivo: Generar lista de candidatos Be para seguimiento espectroscópico.</li>
<li>Acciones:
<ol class="org-ol">
<li>Entregar lista priorizada (ej. 50 objetos no catalogados en SIMBAD).</li>
<li>Coordinar observaciones con espectrógrafos de alta resolución (ej. HERMES@AAT).</li>
<li>Redacción de paper conjunto (segundo autor para ti).</li>
</ol></li>
<li>Sinergias:
<ul class="org-ul">
<li>Las Be comparten espacio de parámetros con PNe (Hα), permitiendo optimizar el método UMAP+HDBSCAN.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org01fd11c" class="outline-4">
<h4 id="org01fd11c"><span class="section-number-4">1.9.4.</span> Tabla de Ejemplo de Candidatos Be (Top 5)</h4>
<div class="outline-text-4" id="text-1-9-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">ID</th>
<th scope="col" class="org-right">RA</th>
<th scope="col" class="org-right">Dec</th>
<th scope="col" class="org-right">r-Hα</th>
<th scope="col" class="org-right">W1-W2</th>
<th scope="col" class="org-right">var<sub>r</sub></th>
<th scope="col" class="org-left">Clasificación SIMBAD</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Be-001</td>
<td class="org-right">123.456</td>
<td class="org-right">+12.345</td>
<td class="org-right">0.8</td>
<td class="org-right">0.1</td>
<td class="org-right">0.3</td>
<td class="org-left">EmLine*</td>
</tr>

<tr>
<td class="org-left">Be-002</td>
<td class="org-right">124.567</td>
<td class="org-right">+13.456</td>
<td class="org-right">1.1</td>
<td class="org-right">0.2</td>
<td class="org-right">0.4</td>
<td class="org-left">-</td>
</tr>

<tr>
<td class="org-left">Be-003</td>
<td class="org-right">125.678</td>
<td class="org-right">+14.567</td>
<td class="org-right">0.7</td>
<td class="org-right">0.0</td>
<td class="org-right">0.2</td>
<td class="org-left">Star</td>
</tr>

<tr>
<td class="org-left">Be-004</td>
<td class="org-right">126.789</td>
<td class="org-right">+15.678</td>
<td class="org-right">1.3</td>
<td class="org-right">0.3</td>
<td class="org-right">0.5</td>
<td class="org-left">-</td>
</tr>

<tr>
<td class="org-left">Be-005</td>
<td class="org-right">127.890</td>
<td class="org-right">+16.789</td>
<td class="org-right">0.9</td>
<td class="org-right">0.1</td>
<td class="org-right">0.3</td>
<td class="org-left">Variable*</td>
</tr>
</tbody>
</table>
</div>
</div>
